using System.Text;
using рядок = System.String;
using байт = System.Byte;
using ціл = System.Int32;
using симв = System.Char;
using Виключення = System.Exception;

Виклик1();

void Виклик1()
{
    байт[] вхідніДані = ПереконвертуватиХекс("49276d206b696c6c696e6720796f757220627261696e206c696b65206120706f69736f6e6f7573206d757368726f6f6d");
    рядок декодованіДані = ЗакодуватиДоБази64(вхідніДані);
    Консоль.НадрукуватиЛінію(декодованіДані);
}

байт[] ПереконвертуватиХекс(рядок хекс)
{
    Список<байт> результат = new();
    for (ціл i = 0; i < хекс.Length; i += 2)
    {
        байт нижній = ХексЗначення(хекс[i + 1]);
        байт верхній = ХексЗначення(хекс[i]);
        результат.Додати((байт)(нижній + (верхній << 4)));
    }

    return результат.ДоМасиву();
}

байт ХексЗначення(симв символ) => символ switch
{
    >= '0' and <= '9' => (байт)(символ - '0'),
    >= 'a' and <= 'f' => (байт)(символ - 'a' + 10),
    >= 'A' and <= 'F' => (байт)(символ - 'A' + 10),
    _ => throw new Виключення($"Не хекс символ {символ}")
};

рядок ЗакодуватиДоБази64(байт[] дані)
{
    БудіникРядків результат = new();
    for (ціл i = 0; i < дані.Length; i+=3)
    {
        ціл sum = дані[i+2] + (дані[i + 1] << 8) + (дані[i] << 16);
        симв w = ВзятиБазу64(sum & 0x3F);
        симв x = ВзятиБазу64((sum >> 6) & 0x3F);
        симв y = ВзятиБазу64((sum >> 12) & 0x3F);
        симв z = ВзятиБазу64((sum >> 18) & 0x3F);
        результат.Додати(z);
        результат.Додати(y);
        результат.Додати(x);
        результат.Додати(w);
    }

    return результат.ДоРядка();
}

симв ВзятиБазу64(ціл значення) => значення switch
{
    >= 0 and <= 25 => (симв)(значення + (байт)'A'),
    >= 26 and <= 51 => (симв)(значення - 26 + (байт)'a'),
    >= 52 and <= 61 => (симв)(значення - 52 + (байт)'0'),
    62 => '+',
    63 => '/'
};

байт[] DecodeBase64(string input)
{
    Список<байт> результат = new();
    for (ціл i = 0; i < input.Length; i+=4)
    {
        ціл w = input[i];
        ціл x = input[i+1];
        ціл y = input[i+2];
        ціл z = input[i+3];

        ціл sum = w + x << 6 + y << 12 + z << 18;

        результат.Додати((байт)(sum & 0xFF));
        результат.Додати((байт)(sum >> 8 & 0xFF));
        результат.Додати((байт)(sum >> 16 & 0xFF));
    }

    return результат.ДоМасиву();
}

static class Консоль
{
    public static void НадрукуватиЛінію(рядок формат)
    {
        System.Console.WriteLine(формат);
    }
}

class Список<Т>
{
    List<Т> список = new();

    public void Додати(Т елемент)
    {
        список.Add(елемент);
    }

    public Т[] ДоМасиву() => список.ToArray();
}

class БудіникРядків
{
    StringBuilder будівник = new();

    public void Додати(симв значення)
    {
        будівник.Append(значення);
    }

    public рядок ДоРядка() => будівник.ToString();
}